{
  "themes": [
    {
      "name": "Stress & Anxiety",
      "hadiths": [
        {
          "text": "No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a Muslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for that.",
          "source": "Sahih al-Bukhari 5641, 5642",
          "context": "This hadith reminds believers that even small difficulties in life serve a purpose in the divine plan. For those experiencing anxiety, it offers comfort that their struggles are not in vain and are acknowledged by Allah.",
          "keywords": ["distress", "sadness", "hurt", "comfort", "acknowledgment", "purpose"]
        },
        {
          "text": "When Allah loves a servant, He tests him.",
          "source": "Tirmidhi",
          "context": "This hadith reframes hardship as a sign of divine love rather than abandonment. For those dealing with stress, it provides perspective that challenges may actually indicate favor and attention from Allah.",
          "keywords": ["hardship", "love", "attention", "perspective", "abandonment"]
        },
        {
          "text": "Verily, the hearts of all the sons of Adam are between the two fingers out of the fingers of the Compassionate Lord as one heart. He turns it (in any direction) as He wills.",
          "source": "Sahih Muslim 2654",
          "context": "This powerful hadith acknowledges Allah's control over our emotional states. For those with anxiety, it reminds them that Allah understands their struggles and has the power to bring comfort and peace to their hearts.",
          "keywords": ["emotional control", "comfort", "peace", "understanding", "divine power"]
        },
        {
          "text": "There is nothing that befalls a believer, not even a thorn that pricks him, but Allah will record a reward for him and a sin will be erased.",
          "source": "Sahih Muslim 2573",
          "context": "This hadith offers solace by showing that every moment of discomfort or anxiety carries spiritual benefit, helping believers find meaning in their difficulties.",
          "keywords": ["discomfort", "meaning", "solace", "reward", "spiritual benefit"]
        },
        {
          "text": "Wonderful is the affair of the believer, for there is good for him in every matter and this is not the case with anyone except the believer. If he is happy, then he thanks Allah and thus there is good for him, and if he is harmed, then he shows patience and thus there is good for him.",
          "source": "Sahih Muslim 2999",
          "context": "This hadith offers a transformative perspective on life's ups and downs, presenting both ease and difficulty as opportunities for spiritual growth, which can help reframe anxious thoughts.",
          "keywords": ["happiness", "patience", "perspective", "gratitude", "contentment", "resilience"]
        }
      ]
    },
    {
      "name": "Depression & Despair",
      "hadiths": [
        {
          "text": "No Muslim is afflicted with harm because of sickness or some other inconvenience, but that Allah will remove his sins for him as a tree sheds its leaves.",
          "source": "Sahih al-Bukhari 5660, Sahih Muslim 2571",
          "context": "This hadith provides hope during times of depression by assuring believers that their suffering has spiritual purpose and is not meaningless.",
          "keywords": ["suffering", "hope", "purpose", "meaning", "renewal"]
        },
        {
          "text": "Allah does not burden a soul beyond that it can bear.",
          "source": "Qur'an 2:286 (mentioned in numerous hadiths)",
          "context": "While primarily from the Qur'an, this concept is reinforced in hadiths and offers profound reassurance to those feeling overwhelmed by depression that their challenges are within their capacity to handle with Allah's help.",
          "keywords": ["overwhelm", "capacity", "reassurance", "strength", "divine support"]
        },
        {
          "text": "The supplication of the distressed person is: 'O Allah, I hope for Your mercy, so do not leave me to myself even for the blinking of an eye, and correct all of my affairs for me. There is none worthy of worship but You.'",
          "source": "Sunan Abu Dawud 5090",
          "context": "This hadith provides a powerful prayer for those in the depths of despair, acknowledging complete dependence on Allah and seeking divine intervention in one's emotional state.",
          "keywords": ["distress", "despair", "mercy", "dependence", "hope", "intervention"]
        },
        {
          "text": "Make things easy and do not make things difficult. Give glad tidings and do not repel people.",
          "source": "Sahih al-Bukhari 69",
          "context": "This hadith encourages gentleness and positivity, reminding those supporting others through depression to approach with kindness and hope rather than severity.",
          "keywords": ["gentleness", "positivity", "hope", "kindness", "encouragement"]
        },
        {
          "text": "The strong believer is better and more beloved to Allah than the weak believer, although both are good. Strive for that which will benefit you, seek the help of Allah, and do not feel helpless.",
          "source": "Sahih Muslim 2664",
          "context": "This hadith encourages action and resilience, providing motivation for those suffering from depression to continue seeking help and beneficial activities rather than surrendering to helplessness.",
          "keywords": ["strength", "action", "resilience", "motivation", "helplessness", "empowerment"]
        }
      ]
    },
    {
      "name": "Loneliness & Isolation",
      "hadiths": [
        {
          "text": "Allah is with those who have patience.",
          "source": "Al-Baqarah 2:153 (mentioned in hadith discussions)",
          "context": "This reminder from the Qur'an, often cited in hadith explanations, assures those feeling alone that divine companionship is always present, especially during difficult times.",
          "keywords": ["companionship", "presence", "patience", "comfort", "assurance"]
        },
        {
          "text": "A believer to another believer is like a building whose different parts enforce each other.",
          "source": "Sahih al-Bukhari 481",
          "context": "This hadith emphasizes the importance of community in Islam, encouraging those feeling isolated to remember they are part of a larger spiritual family that should support one another.",
          "keywords": ["community", "support", "belonging", "connection", "interdependence"]
        },
        {
          "text": "The example of believers in their mutual love, mercy and compassion is like that of a body; if one part of it is in pain, the whole body joins it in staying awake and suffering fever.",
          "source": "Sahih Muslim 2586",
          "context": "This beautiful metaphor illustrates how believers should care for one another, reminding those feeling isolated that they are meant to be connected to a community that feels their pain.",
          "keywords": ["compassion", "belonging", "empathy", "connection", "solidarity", "shared experience"]
        },
        {
          "text": "Allah's hand is with the congregation.",
          "source": "Tirmidhi",
          "context": "This hadith highlights the spiritual blessing found in community, encouraging those experiencing loneliness to seek connection with other believers as a means of drawing closer to Allah.",
          "keywords": ["community", "connection", "belonging", "divine presence", "togetherness"]
        },
        {
          "text": "He who is deprived of gentleness is deprived of all good.",
          "source": "Sahih Muslim 2592",
          "context": "This hadith reminds believers of the importance of gentleness in human interactions, encouraging compassionate outreach to those who are isolated and lonely.",
          "keywords": ["gentleness", "compassion", "kindness", "connection", "goodness"]
        }
      ]
    },
    {
      "name": "Grief & Loss",
      "hadiths": [
        {
          "text": "We belong to Allah and to Him we shall return. O Allah, reward me for my affliction and compensate me with something better.",
          "source": "Sahih Muslim 918",
          "context": "This supplication, taught by the Prophet Muhammad (peace be upon him), provides believers with powerful words to recite in times of loss, acknowledging both divine ownership and the hope for future compensation.",
          "keywords": ["loss", "hope", "comfort", "acceptance", "compensation", "return"]
        },
        {
          "text": "The eyes shed tears and the heart feels pain, but we do not say anything except what pleases our Lord. O Ibrahim, we are grieved by your departure.",
          "source": "Sahih al-Bukhari 1303",
          "context": "Spoken by the Prophet (peace be upon him) upon the death of his son Ibrahim, this hadith validates the natural experience of grief while maintaining appropriate spiritual boundaries.",
          "keywords": ["tears", "pain", "grief", "acceptance", "emotional expression", "loss"]
        },
        {
          "text": "The real patience is at the first stroke of a calamity.",
          "source": "Sahih al-Bukhari 1302",
          "context": "This hadith acknowledges the particular difficulty of the initial impact of loss, validating the intensity of fresh grief while implicitly suggesting that with time, the pain may become more manageable.",
          "keywords": ["patience", "shock", "calamity", "emotional intensity", "resilience", "time"]
        },
        {
          "text": "Allah does not take away the knowledge by taking it away from the hearts of the people, but takes it away by the death of the religious scholars till none of the scholars remains. Then the people will take as their leaders ignorant persons who, when consulted, will give their verdict without knowledge; so they will go astray and will lead others astray.",
          "source": "Sahih al-Bukhari 100",
          "context": "This hadith speaks to communal loss and the passing of generations, reminding believers of the importance of preserving knowledge and wisdom through times of transition and loss.",
          "keywords": ["loss", "transition", "legacy", "community", "continuity", "wisdom"]
        },
        {
          "text": "Whoever Allah wants good for, He puts them to test. He puts them through difficulties.",
          "source": "Sahih al-Bukhari",
          "context": "This hadith reframes loss and grief as potential pathways to spiritual growth rather than merely negative experiences to be endured.",
          "keywords": ["difficulty", "growth", "meaning", "purpose", "perspective", "transformation"]
        }
      ]
    },
    {
      "name": "Anger Management",
      "hadiths": [
        {
          "text": "The strong is not the one who overcomes the people by his strength, but the strong is the one who controls himself while in anger.",
          "source": "Sahih al-Bukhari 6114",
          "context": "This hadith redefines strength from physical power to emotional self-control, elevating anger management to a form of spiritual strength and achievement.",
          "keywords": ["self-control", "strength", "restraint", "emotional regulation", "power"]
        },
        {
          "text": "I know a word which, if he says it, will cause his anger to go away. If he says: 'I seek refuge with Allah from the Satan,' his anger will go away.",
          "source": "Sahih al-Bukhari 6115",
          "context": "The Prophet (peace be upon him) offers a practical spiritual technique for managing anger, connecting emotional regulation to remembrance of Allah.",
          "keywords": ["regulation", "remembrance", "calm", "refuge", "technique"]
        },
        {
          "text": "If one of you becomes angry while standing, he should sit down. If the anger leaves him, well and good; otherwise he should lie down.",
          "source": "Sunan Abu Dawud 4782",
          "context": "This hadith provides practical physical strategies for managing anger, showing Islam's holistic approach to emotional regulation through both spiritual and physical interventions.",
          "keywords": ["regulation", "physical techniques", "calming", "practical steps", "intervention"]
        },
        {
          "text": "Do not become angry, and Paradise will be yours.",
          "source": "Sahih al-Bukhari 6116",
          "context": "This concise advice links anger management directly to spiritual rewards, motivating believers to master their emotions as a pathway to eternal success.",
          "keywords": ["restraint", "reward", "motivation", "emotional mastery", "self-discipline"]
        },
        {
          "text": "Whoever suppresses his anger when he has the power to show it, Allah will call him before all of creation on the Day of Resurrection and let him choose whichever of the fair maidens (of Paradise) he wishes.",
          "source": "Abu Dawud, Tirmidhi",
          "context": "This hadith emphasizes the spiritual reward for controlling anger especially when one has the power to act on it, showing the high value Islam places on emotional self-discipline.",
          "keywords": ["restraint", "power", "discipline", "reward", "self-control", "choice"]
        }
      ]
    },
    {
      "name": "Fear & Hopelessness",
      "hadiths": [
        {
          "text": "When Allah loves a people, He tries them.",
          "source": "Tirmidhi",
          "context": "This hadith reframes fearful situations as potential signs of divine love rather than abandonment, offering a perspective shift for those feeling hopeless.",
          "keywords": ["love", "trials", "perspective", "abandonment", "purpose"]
        },
        {
          "text": "Be mindful of Allah, and Allah will protect you. Be mindful of Allah, and you will find Him in front of you. If you ask, ask of Allah; if you seek help, seek help of Allah. Know that if the whole world were to gather together to benefit you with anything, it would benefit you only with something that Allah had already prescribed for you, and if they gather together to harm you, they would only harm you with something Allah had already prescribed for you.",
          "source": "Tirmidhi",
          "context": "This comprehensive hadith addresses fear by emphasizing Allah's protection and control over all circumstances, providing a foundation for security in an uncertain world.",
          "keywords": ["protection", "security", "mindfulness", "certainty", "trust", "destiny"]
        },
        {
          "text": "None of you should wish for death because of a calamity befalling him; but if he has to wish for death, he should say: 'O Allah! Keep me alive as long as life is better for me, and let me die if death is better for me.'",
          "source": "Sahih al-Bukhari 5671",
          "context": "This hadith acknowledges the depths of hopelessness that can lead to suicidal thoughts while redirecting those feelings toward surrender to divine wisdom.",
          "keywords": ["despair", "surrender", "hopelessness", "wisdom", "life", "death"]
        },
        {
          "text": "Allah says: 'I am just as My slave thinks I am, and I am with him if He remembers Me. If he remembers Me in himself, I too remember him in Myself; and if he remembers Me in a group of people, I remember him in a group that is better than them; and if he comes one span nearer to Me, I go one cubit nearer to him; and if he comes one cubit nearer to Me, I go a distance of two outstretched arms nearer to him; and if he comes to Me walking, I go to him running.'",
          "source": "Sahih al-Bukhari 7405",
          "context": "This hadith qudsi (divine hadith) counters fear and hopelessness by depicting Allah's eager responsiveness to even small movements toward faith and connection.",
          "keywords": ["connection", "responsiveness", "nearness", "hope", "remembrance", "faith"]
        },
        {
          "text": "Hope for what will benefit you, seek help from Allah, and do not give up. If something befalls you, do not say, 'If I had done such and such, it would have been such and such.' Rather say, 'Allah has decreed, and whatever He wills, He does,' for (the words) 'If I had' open the door for Shaytan's work.",
          "source": "Sahih Muslim 2664",
          "context": "This hadith offers practical guidance for maintaining hope while accepting reality, discouraging rumination on the past in favor of trust in divine decree.",
          "keywords": ["hope", "acceptance", "rumination", "trust", "determination", "forward-thinking"]
        }
      ]
    },
    {
      "name": "Guilt & Repentance",
      "hadiths": [
        {
          "text": "Allah extends His hand at night to accept the repentance of those who have sinned during the day, and He extends His hand by day to accept the repentance of those who have sinned during the night – until the sun rises from its setting place [Day of Judgment].",
          "source": "Sahih Muslim 2759",
          "context": "This hadith emphasizes Allah's continuous receptivity to repentance, offering hope to those burdened by guilt that divine forgiveness is always accessible regardless of when sin occurs.",
          "keywords": ["forgiveness", "accessibility", "hope", "receptivity", "continuity", "opportunity"]
        },
        {
          "text": "If you did not sin, Allah would have swept you out of existence and replaced you by another people who would sin, ask for Allah's forgiveness and He would forgive them.",
          "source": "Sahih Muslim 2749",
          "context": "This remarkable hadith reframes the experience of guilt not as evidence of worthlessness but as an inherent part of human nature and an opportunity to experience divine mercy.",
          "keywords": ["mercy", "humanity", "worthiness", "purpose", "acceptance", "opportunity"]
        },
        {
          "text": "All the sons of Adam are sinners, and the best of sinners are those who repent.",
          "source": "Tirmidhi, Ibn Majah",
          "context": "This hadith normalizes moral imperfection while elevating the act of repentance as the distinguishing characteristic of exemplary believers, offering comfort to those struggling with guilt.",
          "keywords": ["normalization", "comfort", "excellence", "renewal", "acceptance", "humanity"]
        },
        {
          "text": "Allah accepts the repentance of His servant as long as his soul does not reach his throat (i.e., before death).",
          "source": "Tirmidhi",
          "context": "This hadith emphasizes that the opportunity for repentance extends throughout one's entire lifetime, encouraging those burdened by guilt to seek forgiveness regardless of how long they have carried their burden.",
          "keywords": ["opportunity", "hope", "time", "accessibility", "relief", "lifelong"]
        },
        {
          "text": "The one who repents from sin is like one who has no sin.",
          "source": "Ibn Majah",
          "context": "This powerful hadith offers complete psychological relief from guilt by assuring believers that sincere repentance completely removes the spiritual burden of past wrongdoing.",
          "keywords": ["relief", "renewal", "fresh start", "freedom", "unburdening", "transformation"]
        }
      ]
    },
    {
      "name": "Hope & Optimism",
      "hadiths": [
        {
          "text": "Allah the Almighty says: 'I am as My servant thinks I am. I am with him when he makes mention of Me. If he makes mention of Me to himself, I make mention of him to Myself; and if he makes mention of Me in an assembly, I make mention of him in an assembly better than it. And if he draws near to Me a hand's span, I draw near to him an arm's length; and if he draws near to Me an arm's length, I draw near to him a fathom's length. And if he comes to Me walking, I go to him at speed.'",
          "source": "Hadith Qudsi 15, Bukhari and Muslim",
          "context": "This divine hadith offers profound hope by depicting Allah as responsive, accessible, and even eager to connect with believers, meeting their smallest efforts with magnified divine response.",
          "keywords": ["responsiveness", "connection", "eagerness", "reciprocity", "accessibility", "nearness"]
        },
        {
          "text": "Look at those who are below you, not those who are above you, for that is more likely to prevent you from belittling Allah's blessing upon you.",
          "source": "Sahih Muslim 2963",
          "context": "This practical advice for maintaining optimism encourages perspective-taking that fosters gratitude rather than discontentment, redirecting focus to blessings already received.",
          "keywords": ["perspective", "gratitude", "contentment", "comparison", "appreciation", "focus"]
        },
        {
          "text": "How wonderful is the situation of a believer; there is good for him in everything and this applies only to a believer. If prosperity attends him, he expresses gratitude to Allah and that is good for him; and if adversity befalls him, he endures it patiently and that is better for him.",
          "source": "Sahih Muslim 2999",
          "context": "This hadith offers a comprehensive framework for optimism that encompasses both good and difficult circumstances, reframing all life experiences as opportunities for spiritual benefit.",
          "keywords": ["gratitude", "patience", "perspective", "reframing", "opportunity", "contentment"]
        },
        {
          "text": "The gates of Paradise will be opened on Mondays and on Thursdays, and every servant who associates nothing with Allah will be forgiven, except for the person who has a grudge against his brother. [About them] it will be said: 'Delay these two until they have reconciled.'",
          "source": "Muslim 2565",
          "context": "This hadith offers hope by depicting regular, recurring opportunities for divine forgiveness, while also emphasizing the importance of maintaining positive human relationships.",
          "keywords": ["forgiveness", "opportunity", "reconciliation", "hope", "regularity", "relationship"]
        },
        {
          "text": "No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a Muslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for that.",
          "source": "Sahih al-Bukhari 5641",
          "context": "This hadith offers an optimistic perspective on suffering by revealing its hidden benefit, allowing believers to find meaning and spiritual progress even in life's smallest discomforts.",
          "keywords": ["meaning", "purpose", "suffering", "progress", "reward", "perspective"]
        }
      ]
    },
    {
      "name": "Patience & Perseverance",
      "hadiths": [
        {
          "text": "How wonderful is the case of a believer; there is good for him in everything and this applies only to a believer. If prosperity attends him, he expresses gratitude to Allah and that is good for him; and if adversity befalls him, he endures it patiently and that is better for him.",
          "source": "Sahih Muslim 2999",
          "context": "This comprehensive hadith frames patience as not merely enduring hardship but as a spiritual opportunity that yields greater benefit than prosperity, encouraging believers to persevere through difficulties.",
          "keywords": ["opportunity", "endurance", "gratitude", "perspective", "benefit", "spiritual growth"]
        },
        {
          "text": "The real patience is at the first stroke of a calamity.",
          "source": "Sahih al-Bukhari 1302",
          "context": "This insight acknowledges that patience is most challenging and therefore most valuable in the initial moments of hardship, validating the difficulty of the first response while implicitly encouraging immediate self-control.",
          "keywords": ["initial response", "self-control", "challenge", "immediacy", "reaction", "restraint"]
        },
        {
          "text": "Victory comes with patience, relief with affliction, and ease with hardship.",
          "source": "Tirmidhi",
          "context": "This concise wisdom connects patience directly to positive outcomes, motivating perseverance by revealing the natural relationship between endurance and breakthrough.",
          "keywords": ["victory", "relief", "ease", "outcome", "endurance", "breakthrough"]
        },
        {
          "text": "No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a Muslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for that.",
          "source": "Sahih al-Bukhari 5641",
          "context": "This hadith provides motivation for patience by revealing the spiritual benefit of every difficulty, no matter how small, encouraging perseverance through awareness of divine purpose in suffering.",
          "keywords": ["purpose", "benefit", "motivation", "meaning", "suffering", "reward"]
        },
        {
          "text": "Whoever persists in being patient, Allah will make him patient. Nobody can be given a blessing better and greater than patience.",
          "source": "Sahih al-Bukhari 1469",
          "context": "This hadith reveals patience as both a practice and a divine gift, suggesting that initial efforts at patience, even if difficult, will be divinely reinforced and lead to greater capacity for endurance.",
          "keywords": ["persistence", "practice", "gift", "development", "capacity", "blessing"]
        }
      ]
    },
    {
      "name": "Faith & Trust in Divine Plan",
      "hadiths": [
        {
          "text": "How amazing is the affair of the believer! There is good for him in everything, and this is not the case for anyone except the believer. If prosperity comes his way, he expresses gratitude to Allah, and that is good for him; and if adversity befalls him, he endures it patiently, and that is good for him.",
          "source": "Sahih Muslim 2999",
          "context": "This hadith presents a comprehensive worldview based on trust in divine wisdom, where both ease and difficulty are interpreted as beneficial, creating a framework for unwavering faith regardless of circumstances.",
          "keywords": ["gratitude", "patience", "perspective", "trust", "wisdom", "contentment"]
        },
        {
          "text": "Allah says: 'I am as My servant thinks of Me. I am with him when he makes mention of Me. If he makes mention of Me to himself, I make mention of him to Myself; and if he makes mention of Me in an assembly, I make mention of him in an assembly better than it.'",
          "source": "Hadith Qudsi, Bukhari and Muslim",
          "context": "This divine hadith ties faith directly to divine responsiveness, suggesting that positive expectations of Allah are fulfilled, which encourages optimistic trust in divine care.",
          "keywords": ["expectations", "responsiveness", "remembrance", "positive thinking", "trust", "presence"]
        },
        {
          "text": "Know that if the nation were to gather together to benefit you with anything, they would not benefit you except with what Allah had already prescribed for you. And if they gather together to harm you with anything, they would not harm you except with what Allah had already prescribed for you.",
          "source": "Tirmidhi",
          "context": "This profound statement offers security through complete trust in divine decree, removing fear of human power by emphasizing Allah's ultimate control over all outcomes.",
          "keywords": ["security", "trust", "divine decree", "surrender", "protection", "certainty"]
        },
        {
          "text": "When Allah wants good for his servant, He hastens his punishment in this world. And when He wants bad for His servant, He withholds punishment for his sins until he appears before Him on the Day of Judgment.",
          "source": "Tirmidhi",
          "context": "This hadith challenges conventional interpretations of hardship, suggesting that immediate difficulties may actually be signs of divine favor rather than abandonment.",
          "keywords": ["perspective", "hardship", "favor", "punishment", "wisdom", "interpretation"]
        },
        {
          "text": "Take advantage of five before five: your youth before your old age, your health before your sickness, your wealth before your poverty, your free time before your preoccupation, and your life before your death.",
          "source": "Hakim, Bayhaqi",
          "context": "This hadith encourages practical faith that balances trust in divine provision with responsible action, recognizing that faith includes both reliance on Allah and purposeful use of what He has provided.",
          "keywords": ["responsibility", "action", "opportunity", "preparation", "balance", "stewardship"]
        }
      ]
    },
    {
      "name": "Self-Worth & Inner Peace",
      "hadiths": [
        {
          "text": "Verily, Allah does not look at your appearance or wealth, but rather He looks at your hearts and actions.",
          "source": "Sahih Muslim 2564",
          "context": "This hadith liberates believers from superficial measures of worth, relocating value from external attributes to internal qualities that are accessible to all regardless of circumstance or privilege.",
          "keywords": ["worth", "value", "authenticity", "internal qualities", "equality", "acceptance"]
        },
        {
          "text": "Richness is not in having many possessions. Rather, true richness is the richness of the soul.",
          "source": "Sahih Bukhari 6446, Sahih Muslim 1051",
          "context": "This hadith redefines wealth from material abundance to inner contentment, offering a pathway to self-worth that is independent of financial or social status.",
          "keywords": ["contentment", "satisfaction", "richness", "happiness", "inner wealth", "detachment"]
        },
        {
          "text": "The strong believer is better and more beloved to Allah than the weak believer, although both are good. Strive for that which will benefit you, seek the help of Allah and do not feel helpless.",
          "source": "Sahih Muslim 2664",
          "context": "While affirming the worth of all believers, this hadith encourages development of inner strength and agency, connecting self-improvement efforts to divine approval.",
          "keywords": ["strength", "self-improvement", "value", "agency", "effort", "empowerment"]
        },
        {
          "text": "Remember Allah during times of ease and He will remember you during times of hardship.",
          "source": "Ahmad",
          "context": "This hadith connects inner peace to consistent spiritual practice, suggesting that regular remembrance of Allah builds a reservoir of tranquility that sustains through difficult times.",
          "keywords": ["remembrance", "consistency", "tranquility", "preparation", "peace", "sustenance"]
        },
        {
          "text": "Indeed, in the remembrance of Allah do hearts find rest.",
          "source": "Qur'an 13:28 (referenced in hadith explanations)",
          "context": "This Qur'anic verse, frequently cited in hadith explanations, offers the most direct path to inner peace through spiritual connection rather than external circumstances.",
          "keywords": ["rest", "peace", "remembrance", "tranquility", "connection", "comfort"]
        }
      ]
    }
  ]
}
