{
  "emotional_themes": [
    {
      "theme": "Stress & Anxiety",
      "verses": [
        {
          "reference": "Surah Al-Baqarah (2:286)",
          "arabic": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا",
          "english": "Allah does not burden a soul beyond that it can bear...",
          "context": "This powerful reminder assures believers that whatever trials they face, Allah knows their capacity and will not test them beyond what they can handle.",
          "keywords": ["burden", "capacity", "reassurance", "divine understanding", "capability", "relief", "comfort"]
        },
        {
          "reference": "Surah Al-Ra'd (13:28)",
          "arabic": "الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
          "english": "Those who believe and whose hearts find rest in the remembrance of Allah. Truly, in the remembrance of Allah do hearts find rest.",
          "context": "This verse highlights that true peace of mind comes through remembrance of Allah, suggesting a spiritual solution to anxiety.",
          "keywords": ["peace of mind", "remembrance", "tranquility", "spiritual calm", "heart's rest", "mindfulness"]
        },
        {
          "reference": "Surah Ash-Sharh (94:5-6)",
          "arabic": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا إِنَّ مَعَ الْعُسْرِ يُسْرًا",
          "english": "For indeed, with hardship [will be] ease. Indeed, with hardship [will be] ease.",
          "context": "The repetition emphasizes the promise that relief accompanies every difficulty, offering hope during stressful times.",
          "keywords": ["relief", "ease", "hardship", "hope", "assurance", "perseverance", "cycles"]
        },
        {
          "reference": "Surah Al-Baqarah (2:155-156)",
          "arabic": "وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ",
          "english": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient, Who, when disaster strikes them, say, 'Indeed we belong to Allah, and indeed to Him we will return.'",
          "context": "This verse acknowledges that tests are part of life but offers a perspective that helps manage anxiety about outcomes.",
          "keywords": ["trials", "patience", "perspective", "acceptance", "resilience", "divine ownership", "return"]
        },
        {
          "reference": "Surah Az-Zumar (39:53)",
          "arabic": "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
          "english": "Say: 'O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful.'",
          "context": "This verse addresses the anxiety that comes from guilt, offering reassurance about Allah's boundless mercy.",
          "keywords": ["mercy", "guilt", "despair", "forgiveness", "hope", "redemption", "divine compassion"]
        }
      ]
    },
    {
      "theme": "Depression & Despair",
      "verses": [
        {
          "reference": "Surah Ad-Duha (93:3-5)",
          "arabic": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ",
          "english": "Your Lord has not taken leave of you, [O Muhammad], nor has He detested [you]. And the Hereafter is better for you than the first [life]. And your Lord is going to give you, and you will be satisfied.",
          "context": "Revealed during a period when the Prophet Muhammad was experiencing distress, these verses reassure that Allah never abandons His servants and better times lie ahead.",
          "keywords": ["abandonment", "divine presence", "hope", "better future", "satisfaction", "promise", "reassurance"]
        },
        {
          "reference": "Surah Al-Baqarah (2:216)",
          "arabic": "وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ ۖ وَعَسَىٰ أَن تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَّكُمْ ۗ وَاللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ",
          "english": "...But perhaps you hate a thing and it is good for you; and perhaps you love a thing and it is bad for you. And Allah knows, while you know not.",
          "context": "This verse offers perspective during depressive episodes by reminding us that our limited perspective may not see the good that can come from difficult situations.",
          "keywords": ["perspective", "divine wisdom", "limited knowledge", "hidden blessings", "greater good", "trust"]
        },
        {
          "reference": "Surah Al-Imran (3:139)",
          "arabic": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ الْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ",
          "english": "So do not weaken and do not grieve, and you will be superior if you are [true] believers.",
          "context": "This verse encourages believers not to succumb to grief or weakness, connecting emotional resilience to faith.",
          "keywords": ["strength", "resilience", "grief", "faith", "superiority", "courage", "empowerment"]
        },
        {
          "reference": "Surah Yusuf (12:87)",
          "arabic": "يَا بَنِيَّ اذْهَبُوا فَتَحَسَّسُوا مِن يُوسُفَ وَأَخِيهِ وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ",
          "english": "O my sons, go and find out about Joseph and his brother and despair not of relief from Allah. Indeed, no one despairs of relief from Allah except the disbelieving people.",
          "context": "From the story of Prophet Yaqub (Jacob), this verse explicitly forbids despair, characterizing hope as an essential aspect of faith.",
          "keywords": ["hope", "relief", "despair", "faith", "perseverance", "action", "divine mercy"]
        },
        {
          "reference": "Surah Al-Isra (17:82)",
          "arabic": "وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ",
          "english": "And We send down of the Quran that which is healing and mercy for the believers...",
          "context": "This verse affirms the Quran itself has healing properties for believers suffering from spiritual or emotional ailments.",
          "keywords": ["healing", "mercy", "spiritual medicine", "comfort", "divine remedy", "restoration"]
        }
      ]
    },
    {
      "theme": "Loneliness & Isolation",
      "verses": [
        {
          "reference": "Surah Al-Hadid (57:4)",
          "arabic": "وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ",
          "english": "And He is with you wherever you are...",
          "context": "A powerful reminder that even in moments of extreme isolation, the believer is never truly alone as Allah's presence is constant.",
          "keywords": ["presence", "companionship", "omnipresence", "comfort", "connection", "divine nearness"]
        },
        {
          "reference": "Surah Al-Baqarah (2:186)",
          "arabic": "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ",
          "english": "And when My servants ask you concerning Me - indeed I am near. I respond to the invocation of the supplicant when he calls upon Me...",
          "context": "This verse emphasizes Allah's closeness and responsiveness, counteracting feelings of abandonment.",
          "keywords": ["nearness", "response", "supplication", "connection", "communication", "divine attention", "accessibility"]
        },
        {
          "reference": "Surah Al-Qasas (28:7)",
          "arabic": "وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي ۖ إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ",
          "english": "And We inspired to the mother of Moses, 'Suckle him; but when you fear for him, cast him into the river and do not fear and do not grieve. Indeed, We will return him to you and will make him [one] of the messengers.'",
          "context": "This verse from the story of Moses shows how Allah provided comfort and reassurance to Moses' mother in her moment of isolation and fear.",
          "keywords": ["divine guidance", "fear", "grief", "trust", "promise", "reunion", "protection"]
        },
        {
          "reference": "Surah Al-Ankabut (29:69)",
          "arabic": "وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا ۚ وَإِنَّ اللَّهَ لَمَعَ الْمُحْسِنِينَ",
          "english": "And those who strive for Us - We will surely guide them to Our ways. And indeed, Allah is with the doers of good.",
          "context": "This verse reassures that those who make effort in Allah's cause receive guidance and divine companionship.",
          "keywords": ["striving", "guidance", "divine presence", "support", "good deeds", "companionship", "reward"]
        },
        {
          "reference": "Surah Al-Imran (3:160)",
          "arabic": "إِن يَنصُرْكُمُ اللَّهُ فَلَا غَالِبَ لَكُمْ ۖ وَإِن يَخْذُلْكُمْ فَمَن ذَا الَّذِي يَنصُرُكُم مِّن بَعْدِهِ ۗ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
          "english": "If Allah should aid you, no one can overcome you; but if He should forsake you, who is there that can aid you after Him? And upon Allah let the believers rely.",
          "context": "This verse encourages complete reliance on Allah, shifting focus from human companionship to divine support.",
          "keywords": ["reliance", "trust", "divine aid", "sufficiency", "dependence", "protection", "strength"]
        }
      ]
    },
    {
      "theme": "Grief & Loss",
      "verses": [
        {
          "reference": "Surah Al-Baqarah (2:156-157)",
          "arabic": "الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ أُولَٰئِكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ ۖ وَأُولَٰئِكَ هُمُ الْمُهْتَدُونَ",
          "english": "Who, when disaster strikes them, say, 'Indeed we belong to Allah, and indeed to Him we will return.' Those are the ones upon whom are blessings from their Lord and mercy. And it is those who are the [rightly] guided.",
          "context": "These verses offer the Islamic response to loss, acknowledging our temporary existence and ultimate return to Allah, bringing comfort and perspective during grief.",
          "keywords": ["calamity", "belonging", "return", "blessings", "mercy", "guidance", "perspective"]
        },
        {
          "reference": "Surah Al-Baqarah (2:153)",
          "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
          "english": "O you who have believed, seek help through patience and prayer. Indeed, Allah is with the patient.",
          "context": "This verse prescribes practical methods (patience and prayer) for coping with grief, assuring divine companionship during difficult times.",
          "keywords": ["patience", "prayer", "help", "coping", "divine presence", "spiritual tools", "support"]
        },
        {
          "reference": "Surah Al-Imran (3:185)",
          "arabic": "كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ ۗ وَإِنَّمَا تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ الْقِيَامَةِ",
          "english": "Every soul will taste death, and you will only be given your [full] compensation on the Day of Resurrection...",
          "context": "This verse normalizes death as an inevitable part of existence for all, helping put personal loss in perspective.",
          "keywords": ["mortality", "universality", "perspective", "compensation", "afterlife", "inevitability", "acceptance"]
        },
        {
          "reference": "Surah Al-Fajr (89:27-30)",
          "arabic": "يَا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ ارْجِعِي إِلَىٰ رَبِّكِ رَاضِيَةً مَّرْضِيَّةً فَادْخُلِي فِي عِبَادِي وَادْخُلِي جَنَّتِي",
          "english": "[To the righteous it will be said], 'O reassured soul, Return to your Lord, well-pleased and pleasing [to Him], And enter among My [righteous] servants, And enter My Paradise.'",
          "context": "These verses offer comfort regarding the state of the deceased believer, presenting death as a return to Allah in a state of peace.",
          "keywords": ["peace", "contentment", "return", "divine pleasure", "acceptance", "paradise", "reunion"]
        },
        {
          "reference": "Surah At-Tawbah (9:51)",
          "arabic": "قُل لَّن يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
          "english": "Say, 'Never will we be struck except by what Allah has decreed for us; He is our protector.' And upon Allah let the believers rely.",
          "context": "This verse helps frame loss within divine decree, encouraging trust in Allah's wisdom even when outcomes are painful.",
          "keywords": ["decree", "trust", "protection", "reliance", "acceptance", "divine plan", "sovereignty"]
        }
      ]
    },
    {
      "theme": "Anger Management",
      "verses": [
        {
          "reference": "Surah Al-Imran (3:134)",
          "arabic": "الَّذِينَ يُنفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ",
          "english": "Who spend [in the cause of Allah] during ease and hardship and who restrain anger and who pardon the people - and Allah loves the doers of good.",
          "context": "This verse praises those who control their anger and forgive others, indicating these are beloved qualities to Allah.",
          "keywords": ["restraint", "pardon", "forgiveness", "self-control", "generosity", "compassion", "divine love"]
        },
        {
          "reference": "Surah Ash-Shura (42:37)",
          "arabic": "وَالَّذِينَ يَجْتَنِبُونَ كَبَائِرَ الْإِثْمِ وَالْفَوَاحِشَ وَإِذَا مَا غَضِبُوا هُمْ يَغْفِرُونَ",
          "english": "And those who avoid the major sins and immoralities, and when they are angry, they forgive.",
          "context": "This verse connects anger management with moral character, suggesting that forgiveness during anger is a sign of righteousness.",
          "keywords": ["forgiveness", "self-control", "righteous character", "moral restraint", "emotional management", "virtue"]
        },
        {
          "reference": "Surah Al-A'raf (7:199)",
          "arabic": "خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ",
          "english": "Take what is given freely, enjoin what is good, and turn away from the ignorant.",
          "context": "This verse advises disengagement from provocative situations that might trigger anger, focusing instead on positive actions.",
          "keywords": ["avoidance", "disengagement", "forgiveness", "positivity", "wisdom", "restraint", "peace"]
        },
        {
          "reference": "Surah Fussilat (41:34)",
          "arabic": "وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ۚ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ",
          "english": "And not equal are the good deed and the bad. Repel [evil] by that [deed] which is better; and thereupon the one whom between you and him is enmity [will become] as though he was a devoted friend.",
          "context": "This verse suggests transforming anger into positive action, showing how responding with goodness can transform relationships.",
          "keywords": ["transformation", "goodness", "reconciliation", "friendship", "higher response", "positive reaction", "relationship healing"]
        },
        {
          "reference": "Surah Al-Hujurat (49:10)",
          "arabic": "إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ ۚ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ",
          "english": "The believers are but brothers, so make settlement between your brothers. And fear Allah that you may receive mercy.",
          "context": "This verse emphasizes brotherhood among believers, encouraging resolution of conflicts rather than harboring anger.",
          "keywords": ["brotherhood", "reconciliation", "conflict resolution", "mercy", "peace", "community", "harmony"]
        }
      ]
    },
    {
      "theme": "Fear & Hopelessness",
      "verses": [
        {
          "reference": "Surah Al-Baqarah (2:155)",
          "arabic": "وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ",
          "english": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient.",
          "context": "This verse acknowledges fear as a test but promises good outcomes for those who respond with patience.",
          "keywords": ["testing", "patience", "fear", "loss", "endurance", "good tidings", "resilience"]
        },
        {
          "reference": "Surah Al-Imran (3:173-174)",
          "arabic": "الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ فَانقَلَبُوا بِنِعْمَةٍ مِّنَ اللَّهِ وَفَضْلٍ لَّمْ يَمْسَسْهُمْ سُوءٌ",
          "english": "Those to whom hypocrites said, 'Indeed, the people have gathered against you, so fear them.' But it [merely] increased them in faith, and they said, 'Sufficient for us is Allah, and [He is] the best Disposer of affairs.' So they returned with favor from Allah and bounty, no harm having touched them...",
          "context": "These verses show how believers transformed fear into increased faith by trusting in Allah.",
          "keywords": ["faith", "trust", "divine sufficiency", "transformation", "courage", "favor", "protection"]
        },
        {
          "reference": "Surah Yunus (10:62-63)",
          "arabic": "أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ",
          "english": "Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve. Those who believed and were fearing Allah.",
          "context": "These verses promise freedom from fear for those who maintain faith and consciousness of Allah.",
          "keywords": ["fearlessness", "grief-free", "divine alliance", "consciousness", "protection", "faith", "security"]
        },
        {
          "reference": "Surah Al-Ankabut (29:2-3)",
          "arabic": "أَحَسِبَ النَّاسُ أَن يُتْرَكُوا أَن يَقُولُوا آمَنَّا وَهُمْ لَا يُفْتَنُونَ وَلَقَدْ فَتَنَّا الَّذِينَ مِن قَبْلِهِمْ ۖ فَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ صَدَقُوا وَلَيَعْلَمَنَّ الْكَاذِبِينَ",
          "english": "Do the people think that they will be left to say, 'We believe' and they will not be tried? But We have certainly tried those before them, and Allah will surely make evident those who are truthful, and He will surely make evident the liars.",
          "context": "These verses frame trials and fear as tests that distinguish true faith, giving purpose to difficult experiences.",
          "keywords": ["testing", "trials", "truthfulness", "purpose", "faith", "sincerity", "refinement"]
        },
        {
          "reference": "Surah Az-Zumar (39:53)",
          "arabic": "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
          "english": "Say, 'O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful.'",
          "context": "This verse directly addresses hopelessness, particularly that which comes from guilt, by emphasizing Allah's expansive mercy.",
          "keywords": ["despair", "hope", "mercy", "forgiveness", "redemption", "guilt", "divine compassion"]
        }
      ]
    },
    {
      "emotional_themes": [
        {
          "theme": "Guilt & Repentance",
          "verses": [
            {
              "reference": "Surah Al-Furqan (25:70-71)",
              "arabic": "إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَٰئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ ۗ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا وَمَن تَابَ وَعَمِلَ صَالِحًا فَإِنَّهُ يَتُوبُ إِلَى اللَّهِ مَتَابًا",
              "english": "Except for those who repent, believe and do righteous work. For them Allah will replace their evil deeds with good. And ever is Allah Forgiving and Merciful. And he who repents and does righteousness does indeed turn to Allah with [accepted] repentance.",
              "context": "These verses offer the profound hope that sincere repentance not only erases sins but transforms them into good deeds in Allah's record.",
              "keywords": ["repentance", "forgiveness", "mercy", "transformation"]
            },
            {
              "reference": "Surah Al-Baqarah (2:222)",
              "arabic": "إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ",
              "english": "Indeed, Allah loves those who are constantly repentant and loves those who purify themselves.",
              "context": "This verse elevates repentance from merely seeking forgiveness to an act that earns Allah's love.",
              "keywords": ["repentance", "purification", "divine love"]
            },
            {
              "reference": "Surah Hud (11:114)",
              "arabic": "وَأَقِمِ الصَّلَاةَ طَرَفَيِ النَّهَارِ وَزُلَفًا مِّنَ اللَّيْلِ ۚ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ۚ ذَٰلِكَ ذِكْرَىٰ لِلذَّاكِرِينَ",
              "english": "And establish prayer at the two ends of the day and at the approach of the night. Indeed, good deeds do away with misdeeds. That is a reminder for those who remember.",
              "context": "This verse offers a practical approach to overcoming guilt through prayer and good deeds which erase previous wrongs.",
              "keywords": ["prayer", "good deeds", "forgiveness"]
            },
            {
              "reference": "Surah Al-Shura (42:25)",
              "arabic": "وَهُوَ الَّذِي يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَعْفُو عَنِ السَّيِّئَاتِ وَيَعْلَمُ مَا تَفْعَلُونَ",
              "english": "And it is He who accepts repentance from His servants and pardons misdeeds, and He knows what you do.",
              "context": "This verse emphasizes Allah's readiness to accept repentance and pardon sins, offering reassurance to those struggling with guilt.",
              "keywords": ["repentance", "forgiveness", "divine knowledge"]
            },
            {
              "reference": "Surah Al-Tahrim (66:8)",
              "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَّصُوحًا عَسَىٰ رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ",
              "english": "O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow...",
              "context": "This verse calls for sincere repentance and connects it to both the removal of sins and ultimate reward in paradise.",
              "keywords": ["repentance", "sincerity", "paradise"]
            }
          ]
        },
        {
          "theme": "Gratitude & Contentment",
          "verses": [
            {
              "reference": "Surah Ibrahim (14:7)",
              "arabic": "وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِن كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ",
              "english": "And [remember] when your Lord proclaimed, 'If you are grateful, I will surely increase you [in favor]; but if you deny, indeed, My punishment is severe.'",
              "context": "This verse establishes gratitude as a means to increased blessings, creating a positive emotional cycle.",
              "keywords": ["gratitude", "blessings", "consequences"]
            },
            {
              "reference": "Surah Ar-Rahman (55:13)",
              "arabic": "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
              "english": "So which of the favors of your Lord would you deny?",
              "context": "This question, repeated throughout Surah Ar-Rahman, invites reflection on Allah's countless blessings, fostering awareness and gratitude.",
              "keywords": ["gratitude", "reflection", "blessings"]
            },
            {
              "reference": "Surah Ad-Duha (93:11)",
              "arabic": "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ",
              "english": "But as for the favor of your Lord, report [it].",
              "context": "This verse encourages actively acknowledging and sharing Allah's blessings as an expression of gratitude.",
              "keywords": ["gratitude", "acknowledgment", "sharing"]
            },
            {
              "reference": "Surah An-Nahl (16:18)",
              "arabic": "وَإِن تَعُدُّوا نِعْمَةَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ اللَّهَ لَغَفُورٌ رَّحِيمٌ",
              "english": "And if you should count the favors of Allah, you could not enumerate them. Indeed, Allah is Forgiving and Merciful.",
              "context": "This verse highlights the immeasurable nature of Allah's blessings, fostering a deep sense of gratitude.",
              "keywords": ["gratitude", "blessings", "divine mercy"]
            },
            {
              "reference": "Surah Al-Hadid (57:23)",
              "arabic": "لِّكَيْلَا تَأْسَوْا عَلَىٰ مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ",
              "english": "In order that you not despair over what has eluded you and not exult [in pride] over what He has given you. And Allah does not like everyone self-deluded and boastful.",
              "context": "This verse encourages emotional balance and contentment with what Allah has provided.",
              "keywords": ["contentment", "balance", "humility"]
            }
          ]
        },
        {
          "theme": "Hope & Optimism",
          "verses": [
            {
              "reference": "Surah Ash-Sharh (94:5-6)",
              "arabic": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا إِنَّ مَعَ الْعُسْرِ يُسْرًا",
              "english": "For indeed, with hardship [will be] ease. Indeed, with hardship [will be] ease.",
              "context": "The repetition emphasizes Allah's promise that relief accompanies every difficulty, infusing hope into challenging situations.",
              "keywords": ["hope", "relief", "perseverance"]
            },
            {
              "reference": "Surah Al-Baqarah (2:286)",
              "arabic": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا",
              "english": "Allah does not burden a soul beyond that it can bear...",
              "context": "This reassurance that trials are calibrated to our capacity encourages optimism about our ability to overcome challenges.",
              "keywords": ["optimism", "trust", "resilience"]
            },
            {
              "reference": "Surah Al-Imran (3:139)",
              "arabic": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ الْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ",
              "english": "So do not weaken and do not grieve, and you will be superior if you are [true] believers.",
              "context": "This verse actively discourages negativity and defeatism, replacing it with optimism rooted in faith.",
              "keywords": ["optimism", "faith", "strength"]
            },
            {
              "reference": "Surah Al-Baqarah (2:216)",
              "arabic": "وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ ۖ وَعَسَىٰ أَن تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَّكُمْ ۗ وَاللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ",
              "english": "...But perhaps you hate a thing and it is good for you; and perhaps you love a thing and it is bad for you. And Allah knows, while you know not.",
              "context": "This verse encourages optimism even in unwanted circumstances, recognizing Allah's wisdom beyond our limited perspective.",
              "keywords": ["optimism", "divine wisdom", "trust"]
            },
            {
              "reference": "Surah Yusuf (12:87)",
              "arabic": "وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ",
              "english": "And do not despair of relief from Allah. Indeed, no one despairs of relief from Allah except the disbelieving people.",
              "context": "This verse explicitly connects hope to faith, presenting optimism as an essential characteristic of belief.",
              "keywords": ["hope", "faith", "perseverance"]
            }
          ]
        },
        {
          "theme": "Patience & Perseverance",
          "verses": [
            {
              "reference": "Surah Al-Baqarah (2:153)",
              "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
              "english": "O you who have believed, seek help through patience and prayer. Indeed, Allah is with the patient.",
              "context": "This verse offers practical methods for cultivating patience and promises divine companionship to those who practice it.",
              "keywords": ["patience", "prayer", "divine support"]
            },
            {
              "reference": "Surah Al-Imran (3:200)",
              "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
              "english": "O you who have believed, persevere and endure and remain stationed and fear Allah that you may be successful.",
              "context": "This verse connects multiple forms of patience with success, encouraging steadfastness in challenging circumstances.",
              "keywords": ["perseverance", "steadfastness", "success"]
            },
            {
              "reference": "Surah Al-Anfal (8:46)",
              "arabic": "وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
              "english": "And obey Allah and His Messenger, and do not dispute and [thus] lose courage and [then] your strength would depart; and be patient. Indeed, Allah is with the patient.",
              "context": "This verse warns against division and encourages unity through patience, linking it to collective strength.",
              "keywords": ["patience", "unity", "strength"]
            },
            {
              "reference": "Surah Az-Zumar (39:10)",
              "arabic": "قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ",
              "english": "Say, 'O My servants who have believed, fear your Lord. For those who do good in this world is good, and the earth of Allah is spacious. Indeed, the patient will be given their reward without account.'",
              "context": "This verse promises unlimited rewards for those who practice patience, highlighting its exceptional value.",
              "keywords": ["patience", "reward", "perseverance"]
            },
            {
              "reference": "Surah Al-Baqarah (2:155-157)",
              "arabic": "وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ أُولَٰئِكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ ۖ وَأُولَٰئِكَ هُمُ الْمُهْتَدُونَ",
              "english": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient, Who, when disaster strikes them, say, 'Indeed we belong to Allah, and indeed to Him we will return.' Those are the ones upon whom are blessings from their Lord and mercy. And it is those who are the [rightly] guided.",
              "context": "These verses frame trials as tests and connect patience with divine blessings, mercy, and guidance.",
              "keywords": ["patience", "trials", "divine mercy", "guidance"]
            }
          ]
        },
        {
          "theme": "Faith & Trust in Divine Plan",
          "verses": [
            {
              "reference": "Surah At-Tawbah (9:51)",
              "arabic": "قُل لَّن يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
              "english": "Say, 'Never will we be struck except by what Allah has decreed for us; He is our protector.' And upon Allah let the believers rely.",
              "context": "This verse encourages trust in divine decree and reliance on Allah's protection, offering emotional security.",
              "keywords": ["trust", "divine decree", "protection"]
            },
            {
              "reference": "Surah Al-Imran (3:173)",
              "arabic": "الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
              "english": "Those to whom hypocrites said, 'Indeed, the people have gathered against you, so fear them.' But it [merely] increased them in faith, and they said, 'Sufficient for us is Allah, and [He is] the best Disposer of affairs.'",
              "context": "This verse shows how believers respond to threats with increased faith and trust in Allah's sufficiency.",
              "keywords": ["faith", "trust", "divine sufficiency"]
            },
            {
              "reference": "Surah Al-Hadid (57:22-23)",
              "arabic": "مَا أَصَابَ مِن مُّصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنفُسِكُمْ إِلَّا فِي كِتَابٍ مِّن قَبْلِ أَن نَّبْرَأَهَا ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ لِّكَيْلَا تَأْسَوْا عَلَىٰ مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ",
              "english": "No disaster strikes upon the earth or among yourselves except that it is in a register before We bring it into being - indeed that, for Allah, is easy - In order that you not despair over what has eluded you and not exult [in pride] over what He has given you. And Allah does not like everyone self-deluded and boastful.",
              "context": "These verses explain that all events are pre-decreed, encouraging emotional equilibrium based on trust in Allah's plan.",
              "keywords": ["divine plan", "trust", "contentment"]
            },
            {
              "reference": "Surah Al-Talaq (65:3)",
              "arabic": "وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ ۚ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ ۚ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا",
              "english": "And He will provide for him from where he does not expect. And whoever relies upon Allah - then He is sufficient for him. Indeed, Allah will accomplish His purpose. Allah has already set for everything a [decreed] extent.",
              "context": "This verse connects trust in Allah with unexpected provision and divine sufficiency, alleviating worry.",
              "keywords": ["trust", "divine provision", "reliance"]
            },
            {
              "reference": "Surah Al-Anfal (8:2)",
              "arabic": "إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
              "english": "The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely.",
              "context": "This verse identifies reliance on Allah as a defining characteristic of believers, connecting it to faith and reverence.",
              "keywords": ["faith", "reverence", "reliance"]
            }
          ]
        },
        {
          "theme": "Self-Worth & Inner Peace",
          "verses": [
            {
              "reference": "Surah Adh-Dhariyat (51:56)",
              "arabic": "وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ",
              "english": "And I did not create the jinn and mankind except to worship Me.",
              "context": "This verse provides a foundational sense of purpose and worth, anchoring one's identity in a sacred relationship with the Divine.",
              "keywords": ["purpose", "worship", "self-worth"]
            },
            {
              "reference": "Surah Al-Isra (17:70)",
              "arabic": "وَلَقَدْ كَرَّمْنَا بَنِي آدَمَ وَحَمَلْنَاهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنَاهُم مِّنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَىٰ كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلًا",
              "english": "And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference.",
              "context": "This verse affirms human dignity as divinely bestowed, countering feelings of worthlessness.",
              "keywords": ["dignity", "self-worth", "divine honor"]
            },
            {
              "reference": "Surah Ash-Shams (91:7-10)",
              "arabic": "وَنَفْسٍ وَمَا سَوَّاهَا فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا قَدْ أَفْلَحَ مَن زَكَّاهَا وَقَدْ خَابَ مَن دَسَّاهَا",
              "english": "And [by] the soul and He who proportioned it And inspired it [with discernment of] its wickedness and its righteousness, He has succeeded who purifies it, And he has failed who instills it [with corruption].",
              "context": "These verses speak to the potential for inner purity and success through self-refinement.",
              "keywords": ["inner purity", "self-refinement", "success"]
            },
            {
              "reference": "Surah Fatir (35:18)",
              "arabic": "وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ",
              "english": "And no bearer of burdens will bear the burden of another...",
              "context": "This principle of individual accountability affirms personal worth independent of others' judgments or actions.",
              "keywords": ["accountability", "self-worth", "individuality"]
            },
            {
              "reference": "Surah Al-Fajr (89:27-30)",
              "arabic": "يَا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ ارْجِعِي إِلَىٰ رَبِّكِ رَاضِيَةً مَّرْضِيَّةً فَادْخُلِي فِي عِبَادِي وَادْخُلِي جَنَّتِي",
              "english": "[To the righteous it will be said], 'O reassured soul, Return to your Lord, well-pleased and pleasing [to Him], And enter among My [righteous] servants, And enter My Paradise.'",
              "context": "These verses describe the tranquil soul that has found contentment in relationship with Allah, the ultimate state of inner peace.",
              "keywords": ["inner peace", "contentment", "paradise"]
            }
          ]
        }
      ]
    }
  ]
}